[net]
batch=32
max_batches=1000
learning_rate=0.001
height=28
width=28
channels=1

[connected]
output=512
activation=relu

[connected]
output=128
activation=relu

[connected]
output=1
activation=relu

[cost]
type=sse